///*
//	개요 : 백준 10799번 쇠막대기
//	요약 :
//		쇠막대기를 레이저로 잘랐을 때 막대기의 개수를 구하자.
//	방법 :
//		스택을 사용한다. 방법은 다음과 같다.
//
//		1. str[i]=='('일 경우:
//			막대기로써 스택에 추가한다.
//			하지만 레이저 역시 '(' 기호를 가지므로 ')'를 마주쳤을 때 적절한 처리를 통해 스택에서 제거한다.(2. 참조)
//
//		2. str[i]==')'일 경우 : 아래 2가지 경우로 나뉜다.
//			1) str[i-1]=='('일 경우 :
//				레이저에 해당하므로 막대기를 자르는 경우이다.
//					1. 스택의 top에 저장된 '('는 막대기가 아니므로 우선 pop한다. stk.pop();
//					2. 여태까지 발견한 막대기를 모두 자르므로 스택에 저장된 막대기 수만큼 pole에 더한다. pole += stk.size();
//			2) str[i-1]==')'
//				하나의 막대기가 끝나는 경우이다.
//				마지막 막대기 조각을 더하고 스택에서 제거한다. pole++, stk.pop();
//	
//	핀포인트
//		1. 스택에 막대기를 저장하는 것과 레이저를 저장하는 것을 앞선 괄호를 통해 판단한다.
//		2. 스택이 막대기를 발견하면 막대기를 그리고, 레이저를 발견하면 저장한 여태 발견한 막대기를 자른다고 생각하면 편하다.
//*/
//#include <iostream>
//#include <stack>
//#include <string>
//
//using namespace std;
//
//int main(void) {
//	int pole = 0;
//	string str;
//	stack<int> stk;
//
//	std::ios::sync_with_stdio(false);
//	
//	cin >> str;
//	
//	for (int i = 0; i < str.size(); i++) {
//		switch(str[i]) {
//			case '(':
//				stk.push(0);
//				break;
//			case ')':
//				stk.pop();
//				if (str[i - 1] == '(') {
//					pole += stk.size();
//				}
//				else 
//					pole += 1;
//				
//				break;
//		}
//	}
//	cout << pole << "\n";
//	return 0;
//}
//
